# Задача 2: Найдите сумму цифр трехзначного числа.

Num = str (input ('введите трехзначное число: '))
sum = int(Num[0])+int(Num[1])+int(Num[2])
print (sum)